; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 9285)
	(= (fuel plane1) 3205)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 9)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 4)
	(at person1 city4)
	(at person2 city0)
	(at person3 city4)
	(at person4 city2)
	(at person5 city1)
	(at person6 city1)
	(at person7 city4)
	(at person8 city0)
	(at person9 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 964)
	(= (distance city0 city2) 956)
	(= (distance city0 city3) 961)
	(= (distance city0 city4) 617)
	(= (distance city1 city0) 964)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 892)
	(= (distance city1 city3) 973)
	(= (distance city1 city4) 983)
	(= (distance city2 city0) 956)
	(= (distance city2 city1) 892)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 639)
	(= (distance city2 city4) 732)
	(= (distance city3 city0) 961)
	(= (distance city3 city1) 973)
	(= (distance city3 city2) 639)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 743)
	(= (distance city4 city0) 617)
	(= (distance city4 city1) 983)
	(= (distance city4 city2) 732)
	(= (distance city4 city3) 743)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city1)
	(at person1 city2)
	(at person2 city0)
	(at person3 city0)
	(at person4 city4)
	(at person5 city1)
	(at person7 city3)
	(at person8 city1)
	(at person9 city2)
	))

(:metric minimize (+ (* 3 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (refuel plane1 city0)
   changed: (fuel plane1) from 3205 to 9285
   goals met: 2 of 9
2. (board person8 plane1 city0)
   deleted: (at person8 city0)
   added: (in person8 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 9
3. (fly plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 0 to 3856, (fuel plane1) from 9285 to 5429
   goals met: 3 of 9
4. (debark person8 plane1 city1)
   deleted: (in person8 plane1)
   added: (at person8 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 9
5. (fly plane1 city1 city2)
   deleted: (at plane1 city1)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 3856 to 7424, (fuel plane1) from 5429 to 1861
   goals met: 3 of 9
6. (refuel plane1 city2)
   changed: (fuel plane1) from 1861 to 9285
   goals met: 3 of 9
7. (board person4 plane1 city2)
   deleted: (at person4 city2)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 9
8. (fly plane1 city2 city4)
   deleted: (at plane1 city2)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 7424 to 10352, (fuel plane1) from 9285 to 6357
   goals met: 3 of 9
9. (debark person4 plane1 city4)
   deleted: (in person4 plane1)
   added: (at person4 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 9
10. (board person1 plane1 city4)
   deleted: (at person1 city4)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 4 of 9
11. (board person3 plane1 city4)
   deleted: (at person3 city4)
   added: (in person3 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 4 of 9
12. (board person7 plane1 city4)
   deleted: (at person7 city4)
   added: (in person7 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 4 of 9
13. (board person9 plane1 city4)
   deleted: (at person9 city4)
   added: (in person9 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 4 of 9
14. (fly plane1 city4 city0)
   deleted: (at plane1 city4)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 10352 to 12820, (fuel plane1) from 6357 to 3889
   goals met: 4 of 9
15. (debark person3 plane1 city0)
   deleted: (in person3 plane1)
   added: (at person3 city0)
   changed: (onboard plane1) from 4 to 3
   goals met: 5 of 9
16. (fly plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 12820 to 16676, (fuel plane1) from 3889 to 33
   goals met: 6 of 9
17. (refuel plane1 city1)
   changed: (fuel plane1) from 33 to 9285
   goals met: 6 of 9
18. (fly plane1 city1 city2)
   deleted: (at plane1 city1)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 16676 to 20244, (fuel plane1) from 9285 to 5717
   goals met: 5 of 9
19. (debark person1 plane1 city2)
   deleted: (in person1 plane1)
   added: (at person1 city2)
   changed: (onboard plane1) from 3 to 2
   goals met: 6 of 9
20. (debark person9 plane1 city2)
   deleted: (in person9 plane1)
   added: (at person9 city2)
   changed: (onboard plane1) from 2 to 1
   goals met: 7 of 9
21. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 20244 to 23812, (fuel plane1) from 5717 to 2149
   goals met: 8 of 9
22. (refuel plane1 city1)
   changed: (fuel plane1) from 2149 to 9285
   goals met: 8 of 9
23. (fly plane1 city1 city3)
   deleted: (at plane1 city1)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 23812 to 27704, (fuel plane1) from 9285 to 5393
   goals met: 7 of 9
24. (debark person7 plane1 city3)
   deleted: (in person7 plane1)
   added: (at person7 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 9
25. (fly plane1 city3 city1)
   deleted: (at plane1 city3)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 27704 to 31596, (fuel plane1) from 5393 to 1501
   goals met: 9 of 9
